readme.html
<!doctype html>
<html lang="et">
<head>
<title>Net Group 2019 a. suveülikooli prooviülesande baas projektid</title>
<!-- 2019-06-20 Thu 12:12 -->
<meta charset="utf-8">
<meta name="viewport" content="width=device-width, initial-scale=1">
<meta name="generator" content="Org-mode">
<meta name="author" content="Svjatoslav Agejenko">

<link  href="https://cdnjs.cloudflare.com/ajax/libs/twitter-bootstrap/3.3.5/css/bootstrap.min.css" rel="stylesheet">
</head>
<body>
<div id="content" class="container">
<div class="row"><div class="col-md-9"><h1 class="title">Net Group 2019 a. suveülikooli prooviülesande baas projektid</h1>
<div id="outline-container-sec-1" class="outline-2">
<h2 id="sec-1"><a id="ID-70e0b784-5df4-480e-b520-36461cb9d299" name="ID-70e0b784-5df4-480e-b520-36461cb9d299"></a><span class="section-number-2">1</span> Maven</h2>
<div class="outline-text-2" id="text-1">
<p>
Näite rakendused baseeruvad Maven teegil.
</p>

<p>
Maveni saab Ubuntus/Debianis paigaldada systeemi ühe käsuga:
</p>
<pre class="example">
sudo apt-get install maven

</pre>

<p>
Windowsis on see keerulisem, ning peab läbi tegema juhendi:
<a href="https://downlinko.com/download-install-apache-maven-windows.html">https://downlinko.com/download-install-apache-maven-windows.html</a>
</p>
</div>
</div>

<div id="outline-container-sec-2" class="outline-2">
<h2 id="sec-2"><span class="section-number-2">2</span> Käsureal põhinev rakendus</h2>
<div class="outline-text-2" id="text-2">
<p>
Käsurea rakenduse põhi on lihtne Maveni projekt. Käsurea argumendina
etteantud fail parsitakse ridadeks ning väljastatakse leitud ridade
arv. Rakenduse projekt asub kataloogis:
</p>

<pre class="example">
diagnostic cli

</pre>
</div>

<div id="outline-container-sec-2-1" class="outline-3">
<h3 id="sec-2-1"><span class="section-number-3">2.1</span> Käivitamine IntelliJ seest koos argumentidega</h3>
<div class="outline-text-3" id="text-2-1">
<p>
Siin on hea õpetus:
<a href="https://www.youtube.com/watch?v=kAAbdoq1to8">https://www.youtube.com/watch?v=kAAbdoq1to8</a>
</p>
</div>
</div>

<div id="outline-container-sec-2-2" class="outline-3">
<h3 id="sec-2-2"><span class="section-number-3">2.2</span> Käivitamine käsurealt</h3>
<div class="outline-text-3" id="text-2-2">
<p>
Eeldus on, et <a href="#sec-1">Maven</a> on paigaldatud süsteemis ja uus mvn käsk on
saadaval.
</p>

<p>
Olles käsureal projekti kataloogis, loome rakenduse paketi:
</p>
<pre class="example">
mvn clean package

</pre>

<p>
Käivitame paketeeritud rakenduse:
</p>
<pre class="example">
java -jar target/*.jar &lt;csvFailiAsukoht&gt;

</pre>
</div>
</div>
</div>
<div id="outline-container-sec-3" class="outline-2">
<h2 id="sec-3"><span class="section-number-2">3</span> Veebil põhinev rakendus</h2>
<div class="outline-text-2" id="text-3">
<p>
Veebi rakenduse põhi on lihtne Maveni projekt. Sisaldab ühte veebi
vormi mitmerealise teksti sisendiga. Sisestatud tekst parsitakse
ridadeks ja näidatakse leitud ridade arv. Rakenduse projekt asub
kataloogis:
</p>

<pre class="example">
diagnostic web

</pre>
</div>

<div id="outline-container-sec-3-1" class="outline-3">
<h3 id="sec-3-1"><span class="section-number-3">3.1</span> Käivitamine käsurealt</h3>
<div class="outline-text-3" id="text-3-1">
<p>
Projekti kataloogis tuleb käivitada käsk:
</p>
<pre class="example">
mvn jetty:run

</pre>

<p>
Peale käivitamist näeb brauseriga rakendust aadressil:
<a href="http://127.0.0.1:8080/">http://127.0.0.1:8080/</a>
</p>
</div>
</div>
</div>
</div><div class="col-md-3"><nav id="table-of-contents">
<div id="text-table-of-contents" class="bs-docs-sidebar">
<ul class="nav">
<li><a href="#sec-1">1. Maven</a></li>
<li><a href="#sec-2">2. Käsureal põhinev rakendus</a>
<ul class="nav">
<li><a href="#sec-2-1">2.1. Käivitamine IntelliJ seest koos argumentidega</a></li>
<li><a href="#sec-2-2">2.2. Käivitamine käsurealt</a></li>
</ul>
</li>
<li><a href="#sec-3">3. Veebil põhinev rakendus</a>
<ul class="nav">
<li><a href="#sec-3-1">3.1. Käivitamine käsurealt</a></li>
</ul>
</li>
</ul>
</div>
</nav>
</div></div></div>
<footer id="postamble" class="">
<div><p class="author">Autor: Svjatoslav Agejenko</p>
<p class="date">Created: 2019-06-20 Thu 12:12</p>
<p class="creator"><a href="http://www.gnu.org/software/emacs/">Emacs</a> 26.1 (<a href="http://orgmode.org">Org-mode</a> 9.1.9)</p>
</div>
</footer>
</body>
</html>
